{"/blog/":{"data":{"":" RSS Feed "},"title":"Blog"},"/docs/":{"data":{"":"\rIntroductionLearn how to create website using Hextra"},"title":"Documentation"},"/docs/authentication/":{"data":{"":"","creating-an-account#Creating an account":"Authentication enables us to filter out low-level bots and spam, enhancing system performance and reducing operational costs. By blocking unauthorized users, we maintain efficiency, allowing Libre API to remain free and sustained through donations while leveraging Cloudflare’s global network for fast, reliable service.\nTo access Libre API, you need an active GitHub account meeting these criteria, These measures ensure a secure, community-driven platform for all developers.:\nthe account must be at least two weeks old linked to a verified email address follow at least one other user the primary email must not be flagged as disposable Creating an account test"},"title":"Authentication"},"/docs/exchange/":{"data":{"":"This section covers the concepts of the arachne protocol.\nHandshake"},"title":"Exchange"},"/docs/exchange/latest/":{"data":{"":"","creating-an-account#Creating an account":"Why do we require authentication for a free API? One major issue we’ve encountered is 🤖 BOTS consuming the entire daily request limit. To prevent this, we enforce authentication.\nTo authenticate, you’ll need to create an account using your mobile phone number. This is because temporary phone numbers are harder to generate than temporary email addresses.\nCreating an account Under our Terms of Service, each individual or company is limited to one account—employees may not create separate accounts for the same organization."},"title":"Latest"},"/docs/introduction/":{"data":{"":"","how-does-it-work#How does it work?":"","why-is-it-free#Why is it free?":"Libre API is a versatile, developer-friendly edge-function API offering free access to multiple services. It delivers high-speed, high-quality APIs, supported by official and community SDKs, empowering developers without compromising performance.\nHow does it work? We leverage the Cloudflare’s Workers platform to deliver lightning-fast edge-function responses. By harnessing Cloudflare’s extensive network of global data centers, we ensure low-latency, high-performance API access for developers worldwide. This infrastructure enables seamless, scalable service delivery, maintaining speed and reliability without compromising quality. Official and community-driven SDKs further simplify integration, empowering developers to build efficiently with our free-to-use, high-speed API ecosystem.\nWhy is it free? At Libre API, we believe developers shouldn’t face unnecessary barriers when building web applications. It’s frustrating to hit a paywall for essential features, especially for straightforward functions like address lookups, exchange rate data, or geolocation services. While some specialized APIs, such as payment processing, may require paid solutions, many core utilities should be freely accessible.\nLibre API provides a robust, free-to-use platform, powered by Cloudflare’s high-speed Workers and global data center network. Our goal is to empower developers with reliable, high-quality APIs without cost constraints, supported by official and community SDKs for seamless integration. By removing financial hurdles, we enable innovation and creativity to thrive, making development more inclusive and efficient.\nWe kindly encourage users who rely on our services to consider making a donation. Your contributions help us maintain and enhance the platform, ensuring our developers can continue delivering high-quality, accessible APIs without financial strain. By supporting Libre API, you’re investing in a vibrant, inclusive developer ecosystem.\nAuthentication\rSDK's"},"title":"Introduction"}}